OpenROAD 41a51eaf4ca2171c92ff38afb91eb37bbd3f36da 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
pdk(libs) defined as:
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lib/sky130_fd_sc_hvl__tt_025C_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lib/sky130_fd_sc_hvl__tt_025C_3v30_lv1v80.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_gpiov2_tt_tt_025C_1v80_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_ground_hvc_wpad_tt_025C_1v80_3v30_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_ground_lvc_wpad_tt_025C_1v80_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_power_lvc_wpad_tt_025C_1v80_3v30_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_xres4v2_tt_tt_025C_1v80_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__gpiov2_pad_tt_tt_025C_1v80_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vdda_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssa_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vddio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped3_pad_tt_025C_1v80_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped3_pad_tt_025C_1v80_3v30_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped_pad_tt_025C_1v80_3v30.lib
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_sram_macros/lib/sky130_sram_2kbyte_1rw1r_32x512_8_TT_1p8V_25C.lib
pdk(lefs) defined as:
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__min.tlef
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/techlef/sky130_fd_sc_hvl__min.tlef
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lef/sky130_fd_io.lef
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lef/sky130_ef_io.lef
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lef/sky130_fd_sc_hvl.lef
/home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
verilog exception: /home/vyom/Project/Counter_caravel_project/caravel/verilog/gl/__user_analog_project_wrapper.v
removing /home/vyom/Project/Counter_caravel_project/caravel/verilog/gl/__user_analog_project_wrapper.v from verilogs list
verilog exception: /home/vyom/Project/Counter_caravel_project/caravel/verilog/gl/caravel-signoff.v
removing /home/vyom/Project/Counter_caravel_project/caravel/verilog/gl/caravel-signoff.v from verilogs list
verilog exception: /home/vyom/Project/Counter_caravel_project/caravel/verilog/gl/caravan-signoff.v
removing /home/vyom/Project/Counter_caravel_project/caravel/verilog/gl/caravan-signoff.v from verilogs list
verilog exception: /home/vyom/Project/Counter_caravel_project/caravel/verilog/gl/__user_project_wrapper.v
removing /home/vyom/Project/Counter_caravel_project/caravel/verilog/gl/__user_project_wrapper.v from verilogs list
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lib/sky130_fd_sc_hvl__tt_025C_3v30.lib
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lib/sky130_fd_sc_hvl__tt_025C_3v30_lv1v80.lib
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_gpiov2_tt_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_gpiov2_tt_tt_025C_1v80_3v30.lib line 33, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_ground_hvc_wpad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_ground_hvc_wpad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_ground_lvc_wpad_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_ground_lvc_wpad_tt_025C_1v80_3v30.lib line 43, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_power_lvc_wpad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_power_lvc_wpad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_xres4v2_tt_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_xres4v2_tt_tt_025C_1v80_3v30.lib line 33, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__gpiov2_pad_tt_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__gpiov2_pad_tt_tt_025C_1v80_3v30.lib line 33, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vdda_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vdda_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssa_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vssa_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vddio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vddio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vssio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped3_pad_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped3_pad_tt_025C_1v80_3v30.lib line 43, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped3_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped3_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped_pad_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped_pad_tt_025C_1v80_3v30.lib line 43, default_fanout_load is 0.0.
exec> read_liberty /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_sram_macros/lib/sky130_sram_2kbyte_1rw1r_32x512_8_TT_1p8V_25C.lib
exec> read_lef /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__min.tlef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__min.tlef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__min.tlef
exec> read_lef /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/techlef/sky130_fd_sc_hvl__min.tlef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hvl/techlef/sky130_fd_sc_hvl__min.tlef
[WARNING ODB-0217] duplicate VIARULE (L1M1_PR) ignoring...
[WARNING ODB-0217] duplicate VIARULE (L1M1_PR_R) ignoring...
[WARNING ODB-0217] duplicate VIARULE (L1M1_PR_M) ignoring...
[WARNING ODB-0217] duplicate VIARULE (L1M1_PR_MR) ignoring...
[WARNING ODB-0217] duplicate VIARULE (L1M1_PR_C) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M1M2_PR) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M1M2_PR_R) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M1M2_PR_M) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M1M2_PR_MR) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M1M2_PR_C) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M2M3_PR) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M2M3_PR_R) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M2M3_PR_M) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M2M3_PR_MR) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M2M3_PR_C) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M3M4_PR) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M3M4_PR_R) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M3M4_PR_M) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M3M4_PR_MR) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M3M4_PR_C) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M4M5_PR) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M4M5_PR_R) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M4M5_PR_M) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M4M5_PR_MR) ignoring...
[WARNING ODB-0217] duplicate VIARULE (M4M5_PR_C) ignoring...
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hvl/techlef/sky130_fd_sc_hvl__min.tlef
exec> read_lef /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef at line 2.

[INFO ODB-0225]     Created 437 library cells
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef
exec> read_lef /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lef/sky130_fd_io.lef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_fd_io.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_fd_io.lef at line 2.

[INFO ODB-0225]     Created 22 library cells
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_fd_io.lef
[WARNING ORD-1001] LEF macro sky130_fd_io__top_ground_hvc_wpad pin PADISOR missing from liberty cell.
[WARNING ORD-1001] LEF macro sky130_fd_io__top_ground_hvc_wpad pin PADISOL missing from liberty cell.
[WARNING ORD-1001] LEF macro sky130_fd_io__top_ground_lvc_wpad pin PADISOR missing from liberty cell.
[WARNING ORD-1001] LEF macro sky130_fd_io__top_ground_lvc_wpad pin PADISOL missing from liberty cell.
[WARNING ORD-1001] LEF macro sky130_fd_io__top_power_lvc_wpad pin PADISOR missing from liberty cell.
[WARNING ORD-1001] LEF macro sky130_fd_io__top_power_lvc_wpad pin PADISOL missing from liberty cell.
exec> read_lef /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef at line 2.

[WARNING ODB-0220] WARNING (LEFPARS-2036): SOURCE statement is obsolete in version 5.6 and later.
The LEF parser will ignore this statement.
To avoid this warning in the future, remove this statement from the LEF file with version 5.6 or later. See file /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef at line 142.

[INFO ODB-0225]     Created 4 library cells
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef
exec> read_lef /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_io/lef/sky130_ef_io.lef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_ef_io.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_ef_io.lef at line 2.

[INFO ODB-0225]     Created 37 library cells
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_ef_io.lef
exec> read_lef /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lef/sky130_fd_sc_hvl.lef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hvl/lef/sky130_fd_sc_hvl.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hvl/lef/sky130_fd_sc_hvl.lef at line 2.

[INFO ODB-0225]     Created 69 library cells
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_fd_sc_hvl/lef/sky130_fd_sc_hvl.lef
exec> read_lef /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref/sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
exec> read_lef /home/vyom/Project/Counter_caravel_project/caravel/lef/user_project_wrapper_empty.lef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/caravel/lef/user_project_wrapper_empty.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/vyom/Project/Counter_caravel_project/caravel/lef/user_project_wrapper_empty.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/caravel/lef/user_project_wrapper_empty.lef
exec> read_lef /home/vyom/Project/Counter_caravel_project/caravel/lef/user_analog_project_wrapper_empty.lef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/caravel/lef/user_analog_project_wrapper_empty.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/vyom/Project/Counter_caravel_project/caravel/lef/user_analog_project_wrapper_empty.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/caravel/lef/user_analog_project_wrapper_empty.lef
exec> read_lef /home/vyom/Project/Counter_caravel_project/mgmt_core_wrapper/lef/mgmt_core_wrapper.lef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/mgmt_core_wrapper/lef/mgmt_core_wrapper.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/vyom/Project/Counter_caravel_project/mgmt_core_wrapper/lef/mgmt_core_wrapper.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/mgmt_core_wrapper/lef/mgmt_core_wrapper.lef
exec> read_lef /home/vyom/Project/Counter_caravel_project/mgmt_core_wrapper/lef/RAM256.lef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/mgmt_core_wrapper/lef/RAM256.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/vyom/Project/Counter_caravel_project/mgmt_core_wrapper/lef/RAM256.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/mgmt_core_wrapper/lef/RAM256.lef
exec> read_lef /home/vyom/Project/Counter_caravel_project/mgmt_core_wrapper/lef/RAM128.lef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/mgmt_core_wrapper/lef/RAM128.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/vyom/Project/Counter_caravel_project/mgmt_core_wrapper/lef/RAM128.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/mgmt_core_wrapper/lef/RAM128.lef
exec> read_lef /home/vyom/Project/Counter_caravel_project/lef/user_project_wrapper.lef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/lef/user_project_wrapper.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/vyom/Project/Counter_caravel_project/lef/user_project_wrapper.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/lef/user_project_wrapper.lef
exec> read_lef /home/vyom/Project/Counter_caravel_project/lef/user_proj_example.lef
[INFO ODB-0222] Reading LEF file: /home/vyom/Project/Counter_caravel_project/lef/user_proj_example.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/vyom/Project/Counter_caravel_project/lef/user_proj_example.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/vyom/Project/Counter_caravel_project/lef/user_proj_example.lef
exec> read_def /home/vyom/Project/Counter_caravel_project/def/user_proj_example.def
[INFO ODB-0127] Reading DEF file: /home/vyom/Project/Counter_caravel_project/def/user_proj_example.def
[INFO ODB-0128] Design: user_proj_example
[INFO ODB-0094] 		Created 100000 Insts
[INFO ODB-0094] 		Created 200000 Insts
[INFO ODB-0094] 		Created 300000 Insts
[INFO ODB-0094] 		Created 400000 Insts
[INFO ODB-0130]     Created 543 pins.
[INFO ODB-0131]     Created 487167 components and 1812672 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 1810212 connections.
[INFO ODB-0133]     Created 1044 nets and 2329 connections.
[INFO ODB-0134] Finished DEF file: /home/vyom/Project/Counter_caravel_project/def/user_proj_example.def
exec> define_process_corner -ext_model_index 0 X
[INFO RCX-0431] Defined process_corner X with ext_model_index 0
[INFO RCX-0029] Defined extraction corner X
exec> extract_parasitics  -ext_model_file /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.tech//openlane/rules.openrcx.sky130A.min.calibre  -lef_res
[INFO RCX-0008] extracting parasitics of user_proj_example ...
[INFO RCX-0435] Reading extraction model file /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.tech//openlane/rules.openrcx.sky130A.min.calibre ...
[INFO RCX-0436] RC segment generation user_proj_example (max_merge_res 50.0) ...
[INFO RCX-0040] Final 3314 rc segments
[INFO RCX-0439] Coupling Cap extraction user_proj_example ...
[INFO RCX-0440] Coupling threshhold is 0.1000 fF, coupling capacitance less than 0.1000 fF will be grounded.
[INFO RCX-0043] 29581 wires to be extracted
[INFO RCX-0442] 30% completion -- 8951 wires have been extracted
[INFO RCX-0442] 52% completion -- 15411 wires have been extracted
[INFO RCX-0442] 91% completion -- 27054 wires have been extracted
[INFO RCX-0442] 98% completion -- 29163 wires have been extracted
[INFO RCX-0045] Extract 1044 nets, 4072 rsegs, 4072 caps, 5558 ccs
[INFO RCX-0015] Finished extracting user_proj_example.
exec> write_spef /home/vyom/Project/Counter_caravel_project/signoff/user_proj_example/openlane-signoff/spef/user_proj_example.min.spef
[INFO RCX-0016] Writing SPEF ...
[INFO RCX-0443] 1044 nets finished
[INFO RCX-0017] Finished writing SPEF ...
exec> read_spef /home/vyom/Project/Counter_caravel_project/signoff/user_proj_example/openlane-signoff/spef/user_proj_example.min.spef
spef: /home/vyom/Project/Counter_caravel_project/signoff/user_proj_example/openlane-signoff/spef/user_proj_example.min.spef
def: /home/vyom/Project/Counter_caravel_project/def/user_proj_example.def
rcx: /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.tech//openlane/rules.openrcx.sky130A.min.calibre
rcx-corner: min
lib-corner: t.tcl
tech_lef: /home/vyom/Project/Counter_caravel_project/dependencies/pdks/sky130A/libs.ref//sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__min.tlef
